zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2661/startup_MIMXRT2661.c
WEAK void MAIN_EDMA5_CH15_IRQHandler(void)
{
    EDMA_DriverIRQHandler(1U, 15U);
}

WEAK void MAIN_FREQME_IRQHandler(void)
{
    MAIN_FREQME_DriverIRQHandler();
}

WEAK void HSP_STM_IRQHandler(void)
{
    STM_DriverIRQHandler(0U);
}

WEAK void Reserved95_IRQHandler(void)
{
    Reserved95_DriverIRQHandler();
}

WEAK void Reserved96_IRQHandler(void)
{
    Reserved96_DriverIRQHandler();
}

WEAK void Reserved97_IRQHandler(void)
{
    Reserved97_DriverIRQHandler();
}

WEAK void MAIN_XSPI0_IRQHandler(void)
{
    XSPI_DriverIRQHandler(0U);
}

WEAK void MAIN_XSPI1_IRQHandler(void)
{
    XSPI_DriverIRQHandler(1U);
}

WEAK void Reserved100_IRQHandler(void)
{
    Reserved100_DriverIRQHandler();
}

WEAK void Reserved101_IRQHandler(void)
{
    Reserved101_DriverIRQHandler();
}

WEAK void SYSCON_CGU_INT0_IRQHandler(void)
{
    SYSCON_CGU_INT0_DriverIRQHandler();
}

WEAK void SYSCON_CGU_INT1_IRQHandler(void)
{
    SYSCON_CGU_INT1_DriverIRQHandler();
}

WEAK void SYSCON_CGU_INT2_IRQHandler(void)
{
    SYSCON_CGU_INT2_DriverIRQHandler();
}

WEAK void MAIN_CSSI_IRQHandler(void)
{
    MAIN_CSSI_DriverIRQHandler();
}

WEAK void MAIN_CSSI_SENTMU0A_IRQHandler(void)
{
    MAIN_CSSI_SENTMU0A_DriverIRQHandler();
}

WEAK void MAIN_CSSI_SENTMU1A_IRQHandler(void)
{
    MAIN_CSSI_SENTMU1A_DriverIRQHandler();
}

WEAK void Reserved108_IRQHandler(void)
{
    Reserved108_DriverIRQHandler();
}

WEAK void SYSCON_PMU_INT0_IRQHandler(void)
{
    SYSCON_PMU_INT0_DriverIRQHandler();
}

WEAK void SYSCON_PMU_INT1_IRQHandler(void)
{
    SYSCON_PMU_INT1_DriverIRQHandler();
}

WEAK void SYSCON_RESETCON_IRQHandler(void)
{
    SYSCON_RESETCON_DriverIRQHandler();
}

WEAK void SYSCON_FREQME_IRQHandler(void)
{
    SYSCON_FREQME_DriverIRQHandler();
}

WEAK void Reserved113_IRQHandler(void)
{
    Reserved113_DriverIRQHandler();
}

WEAK void Reserved114_IRQHandler(void)
{
    Reserved114_DriverIRQHandler();
}

WEAK void Reserved115_IRQHandler(void)
{
    Reserved115_DriverIRQHandler();
}

WEAK void HSP_XBAR0_CH0_IRQHandler(void)
{
    HSP_XBAR0_CH0_DriverIRQHandler();
}

WEAK void HSP_XBAR0_CH1_IRQHandler(void)
{
    HSP_XBAR0_CH1_DriverIRQHandler();
}

WEAK void HSP_XBAR0_CH2_IRQHandler(void)
{
    HSP_XBAR0_CH2_DriverIRQHandler();
}

WEAK void HSP_XBAR0_CH3_IRQHandler(void)
{
    HSP_XBAR0_CH3_DriverIRQHandler();
}

WEAK void HSP_XBAR0_CH4_IRQHandler(void)
{
    HSP_XBAR0_CH4_DriverIRQHandler();
}

WEAK void HSP_XBAR0_CH5_IRQHandler(void)
{
    HSP_XBAR0_CH5_DriverIRQHandler();
}

WEAK void HSP_XBAR0_CH6_IRQHandler(void)
{
    HSP_XBAR0_CH6_DriverIRQHandler();
}

WEAK void HSP_XBAR0_CH7_IRQHandler(void)
{
    HSP_XBAR0_CH7_DriverIRQHandler();
}

WEAK void Reserved124_IRQHandler(void)
{
    Reserved124_DriverIRQHandler();
}

WEAK void Reserved125_IRQHandler(void)
{
    Reserved125_DriverIRQHandler();
}

WEAK void Reserved126_IRQHandler(void)
{
    Reserved126_DriverIRQHandler();
}

WEAK void Reserved127_IRQHandler(void)
{
    Reserved127_DriverIRQHandler();
}

WEAK void HSP_ADC0_IRQHandler(void)
{
    HSP_ADC0_DriverIRQHandler();
}

WEAK void HSP_ADC1_IRQHandler(void)
{
    HSP_ADC1_DriverIRQHandler();
}

WEAK void HSP_DAC_IRQHandler(void)
{
    HSP_DAC_DriverIRQHandler();
}

WEAK void HSP_LPIT0_IRQHandler(void)
{
    HSP_LPIT0_DriverIRQHandler();
}

WEAK void HSP_LPIT1_IRQHandler(void)
{
    HSP_LPIT1_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM0_CH0_IRQHandler(void)
{
    HSP_EFLEXPWM0_CH0_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM0_CH1_IRQHandler(void)
{
    HSP_EFLEXPWM0_CH1_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM0_CH2_IRQHandler(void)
{
    HSP_EFLEXPWM0_CH2_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM0_CH3_IRQHandler(void)
{
    HSP_EFLEXPWM0_CH3_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM0_ERROR_IRQHandler(void)
{
    HSP_EFLEXPWM0_ERROR_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM1_CH0_IRQHandler(void)
{
    HSP_EFLEXPWM1_CH0_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM1_CH1_IRQHandler(void)
{
    HSP_EFLEXPWM1_CH1_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM1_CH2_IRQHandler(void)
{
    HSP_EFLEXPWM1_CH2_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM1_CH3_IRQHandler(void)
{
    HSP_EFLEXPWM1_CH3_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM1_ERROR_IRQHandler(void)
{
    HSP_EFLEXPWM1_ERROR_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM2_CH0_IRQHandler(void)
{
    HSP_EFLEXPWM2_CH0_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM2_CH1_IRQHandler(void)
{
    HSP_EFLEXPWM2_CH1_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM2_CH2_IRQHandler(void)
{
    HSP_EFLEXPWM2_CH2_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM2_CH3_IRQHandler(void)
{
    HSP_EFLEXPWM2_CH3_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM2_ERROR_IRQHandler(void)
{
    HSP_EFLEXPWM2_ERROR_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM3_CH0_IRQHandler(void)
{
    HSP_EFLEXPWM3_CH0_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM3_CH1_IRQHandler(void)
{
    HSP_EFLEXPWM3_CH1_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM3_CH2_IRQHandler(void)
{
    HSP_EFLEXPWM3_CH2_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM3_CH3_IRQHandler(void)
{
    HSP_EFLEXPWM3_CH3_DriverIRQHandler();
}

WEAK void HSP_EFLEXPWM3_ERROR_IRQHandler(void)
{
    HSP_EFLEXPWM3_ERROR_DriverIRQHandler();
}

WEAK void HSP_QTPM0_IRQHandler(void)
{
    TPM_DriverIRQHandler(0U);
}

WEAK void HSP_QTPM1_IRQHandler(void)
{
    TPM_DriverIRQHandler(1U);
}

WEAK void HSP_QTPM2_IRQHandler(void)
{
    TPM_DriverIRQHandler(2U);
}

WEAK void HSP_QTPM3_IRQHandler(void)
{
    TPM_DriverIRQHandler(3U);
}

WEAK void Reserved157_IRQHandler(void)
{
    Reserved157_DriverIRQHandler();
}

WEAK void Reserved158_IRQHandler(void)
{
    Reserved158_DriverIRQHandler();
}

WEAK void Reserved159_IRQHandler(void)
{
    Reserved159_DriverIRQHandler();
}

WEAK void Reserved160_IRQHandler(void)
{
    Reserved160_DriverIRQHandler();
}

WEAK void Reserved161_IRQHandler(void)
{
    Reserved161_DriverIRQHandler();
}

WEAK void Reserved162_IRQHandler(void)
{
    Reserved162_DriverIRQHandler();
}

WEAK void Reserved163_IRQHandler(void)
{
    Reserved163_DriverIRQHandler();
}

