zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2661/startup_MIMXRT2661.c
    AUDIO_EDMA3_CH7_IRQHandler,      // 294: AUDIO EDMA3: Channel 7 interrupt
    Reserved295_IRQHandler,          // 295: Reserved interrupt
    Reserved296_IRQHandler,          // 296: Reserved interrupt
    Reserved297_IRQHandler,          // 297: Reserved interrupt
    Reserved298_IRQHandler,          // 298: Reserved interrupt
    Reserved299_IRQHandler,          // 299: Reserved interrupt
    Reserved300_IRQHandler,          // 300: Reserved interrupt
    Reserved301_IRQHandler,          // 301: Reserved interrupt
    Reserved302_IRQHandler,          // 302: Reserved interrupt
    Reserved303_IRQHandler,          // 303: Reserved interrupt
    AUDIO_ASRC_IRQHandler,           // 304: AUDIO ASRC interrupt
    AUDIO_FREQME_IRQHandler,         // 305: AUDIO FREQME interrupt
    Reserved306_IRQHandler,          // 306: Reserved interrupt
    Reserved307_IRQHandler,          // 307: Reserved interrupt
    Reserved308_IRQHandler,          // 308: Reserved interrupt
    Reserved309_IRQHandler,          // 309: Reserved interrupt
    Reserved310_IRQHandler,          // 310: Reserved interrupt
    COMM_TRDC_IRQHandler,            // 311: COMM TRDC interrupt
    COMM_ENET_QOS_IRQHandler,        // 312: COMM ENET_QOS interrupt
    COMM_ENET_QOS_TX_IRQHandler,     // 313: ENET_QOS: Per Channel Transmit Interrupt Signal To Host System
    COMM_ENET_QOS_RX_IRQHandler,     // 314: ENET_QOS: Per Channel Receive Interrupt Signal To Host System
    COMM_ENET_TX_IRQHandler,         // 315: COMM ENET TX interrupt
    COMM_ENET_RX_IRQHandler,         // 316: COMM ENET RX interrupt
    COMM_ENET_OTHER_IRQHandler,      // 317: ENET_1G_MAC: ETH OTHER_INT0_17
    COMM_ENET_1588_IRQHandler,       // 318: ENET_1G_MAC: IEEE-1588 Timer Interrupt
    COMM_FLEXSPI_SLV_IRQHandler,     // 319: COMM FlexSPI follower interrupt
    COMM_USB0_IRQHandler,            // 320: COMM USBHS interrupt
    COMM_USBPHY_IRQHandler,          // 321: COMM USBPHY interrupt
    COMM_USB1_IRQHandler,            // 322: COMM USBFS interrupt
    COMM_USDHC0_IRQHandler,          // 323: COMM USDHC0 interrupt
    COMM_USDHC1_IRQHandler,          // 324: COMM USDHC1 interrupt
    Reserved325_IRQHandler,          // 325: Reserved interrupt
    COMM_TENBASET_PHY0_IRQHandler,   // 326: XENO_PHY0:Functional IRQ1 interrupt request
    Reserved327_IRQHandler,          // 327: Reserved interrupt
    COMM_TENBASET_PHY1_IRQHandler,   // 328: XENO_PHY1:Functional IRQ1 interrupt request
    Reserved329_IRQHandler,          // 329: Reserved interrupt
    COMM_FREQME_IRQHandler,          // 330: COMM FREQME interrupt
    MEDIA_TRDC_IRQHandler,           // 331: MEDIA TRDC interrupt
    Reserved332_IRQHandler,          // 332: Reserved interrupt
    MEDIA_DCIF_CH0_IRQHandler,       // 333: MEDIA DCIF channel 0 interrupt
    MEDIA_DCIF_CH1_IRQHandler,       // 334: MEDIA DCIF channel 1 interrupt
    MEDIA_DCIF_CH2_IRQHandler,       // 335: MEDIA DCIF channel 2 interrupt
    MEDIA_DCIF_CH3_IRQHandler,       // 336: MEDIA DCIF channel 3 interrupt
    MEDIA_DCIF_CH4_IRQHandler,       // 337: MEDIA DCIF channel 4 interrupt
    MEDIA_DCIF_CH5_IRQHandler,       // 338: MEDIA DCIF channel 5 interrupt
    MEDIA_DCIF_CH6_IRQHandler,       // 339: MEDIA DCIF channel 6 interrupt
    MEDIA_DCIF_CH7_IRQHandler,       // 340: MEDIA DCIF channel 7 interrupt
    MEDIA_DCIF_CH8_IRQHandler,       // 341: MEDIA DCIF channel 8 interrupt
    Reserved342_IRQHandler,          // 342: Reserved interrupt
    MEDIA_REFORMATTER_IRQHandler,    // 343: MEDIA REFORMATTER interrupt
    MEDIA_ISI_IRQHandler,            // 344: MEDIA ISI interrupt
    MEDIA_TINGPU_IRQHandler,         // 345: MEDIA TINGPU interrupt
    MEDIA_JPEGDEC_IRQHandler,        // 346: MEDIA JPEGDEC interrupt
    Reserved347_IRQHandler,          // 347: Reserved interrupt
    Reserved348_IRQHandler,          // 348: Reserved interrupt
    MEDIA_FREQME_IRQHandler,         // 349: MEDIA FREQME interrupt
};                                     /* End of vector table */

//*****************************************************************************
// Section 6: Reset_Handler
//*****************************************************************************

STARTUP_RESET_ATTR
void Reset_Handler(void)
{
    // Disable interrupts
    __asm volatile("cpsid i");

    // Enable CP10/CP11 (FPU/MVE) before any C code runs. With the hard-float
    // ABI the compiler may use FP/MVE registers in function prologues (e.g.
    // vpush in Reset_Handler_C at high optimization levels), which raises a
    // NOCP UsageFault if the coprocessors are still disabled at that point.
    __asm volatile(
        "LDR R0, =0xE000ED88  \n"
        "LDR R1, [R0]         \n"
        "ORR R1, R1, #0xF00000\n"
        "STR R1, [R0]         \n"
        "DSB                  \n"
        "ISB                  \n"
                    :
                    :
                    : "r0", "r1");

    // Config VTOR, MSP, MSPLIM (ARMv8-M hardware stack overflow guard).
    // Order: clear MSPLIM to 0 first (in case ROM left it set), then update
    // MSP to the new top, then set MSPLIM to the real stack base. This
    // ensures the hardware invariant MSP >= MSPLIM holds throughout.
    __asm volatile(
        "LDR R0, =0xE000ED08  \n"
        "STR %0, [R0]         \n"
        "MOVS R1, #0          \n"
        "MSR MSPLIM, R1       \n"
        "LDR R1, [%0]         \n"
        "MSR MSP, R1          \n"
        "MSR MSPLIM, %1       \n"
                    :
                    : "r"(STARTUP_VT_SYMBOL), "r"(_vStackBase)
                    : "r0", "r1");

    // Call Reset_Handler_C; trap here if it unexpectedly returns.
    __asm volatile ("LDR R0, =Reset_Handler_C \n"
                    "BLX R0                   \n"
                    "1: B 1b                  \n"
                    );
}

//*****************************************************************************
// Section 7: Reset_Handler_C
//*****************************************************************************

STARTUP_RESET_C_ATTR
void Reset_Handler_C(void)
{
#if !defined(__NO_SYSTEM_INIT)
    SystemInit();
#endif
    STARTUP_RUNTIME_PROLOG();
    STARTUP_RUNTIME_ENTER();
}

//*****************************************************************************
// Section 8: End scaffolding
//*****************************************************************************

#if defined(__cplusplus)
} // extern "C"
#endif

STARTUP_PRAGMA_POP
